% 適応イコライザのシミュレーション (Part I)
%
% このスクリプトは、PSK変調、raised-cosineパルス成形、マルチパスフェージング、
% および、適応等化を使った通信回線のシミュレーションを行います。
%
% 2つのパートの前半の部分です: Part I (adapteqpt1.m) は、シミュレーション
% パラメータを設定し、チャネルとイコライザオブジェクトを作成します。
% Part II (adapteqpt2.m) は、MATLABのワークスペースに格納されたこれらの
% 設定を元に回線のシミュレーションを実行します。Part IIのスクリプトの
% 情報については、MATLABのプロンプトで demo('toolbox','comm') を入力して
%  "Adaptive Equalizer Simulation (Part II)" を選択してください。
%
% Part I は、3つのシナリオが用意されており、これらのそれぞれにおいて
% Part II を複数回呼び出します。それぞれの呼び出しは、送信ブロックに対応
% します。パルス成形とマルチパスフェージングチャネルは、状態の情報を1つの
% ブロックからつぎに保存します。適応イコライザの収束でチャネルフェージング
% の影響を可視化するために、シミュレーションは各ブロックのイコライザの
% 状態をリセットします。
% 
% 異なるシミュレーション設定を使って実験するために、Part I スクリプトを
% 編集することが可能です。たとえば、イコライザオブジェクトの ResetBeforeFiltering 
% プロパティを0に設定することができます。この場合、イコライザは1つのブロック
% からつぎのブロックまで状態を保持します。


%   Copyright 1996-2004 The MathWorks, Inc.
