% ベースバンド QPSK シミュレーションの例題
%
% [RATIO, ERRORS] = SIMBASEBANDEX(EbNo) は、キャリア上で変調された信号
% の複素ベースバンド等価表現を使って、変調をシミュレートする方法をデモ
% します。4相位相変調(QPSK)について、加法的白色雑音の存在下で信号の
% 復調と検出もデモします。EbNo は、シミュレーションに対するチャネルの
% ビットあたりのS/N比を含むベクトルです。このファイルは、EbNoのリストの
% 各々についてシミュレーションを実行します。各シミュレーションは、最小
% シミュレーション回数が終了し、誤りの数が 'expSymErrs' (60シンボル)以上
% になるまで実行します。SIMBASEBANDEX はその後シミュレーション結果と
% QPSKに対する理論曲線を生成された通りにプロットします。
%
% SIMBASEBANDEX は、M を4から2に変更することによって、バイナリPSK(BPSK)
% のシミュレーションに変更することが可能です。他のシミュレーションへの
% 変更(すなわち変調タイプとアルファベット)は、予想される結果を生成する
% 式の変更が必要です。


%   Copyright 1996-2004 The MathWorks, Inc.
